// ————————————————————————————————————————————————————————————————————————————————
// Читання даних із сайту http://rodovyi-vidminok.wikidot.com/
// - Відкрити сайт
// - Відкрити консоль
// - Вставити й виконати цей код
// ————————————————————————————————————————————————————————————————————————————————

// ————————————————————————————————————————————————————————————————————————————————
// Очистка HTML-вмісту головного елемента від зайвих для нас елементів
// ————————————————————————————————————————————————————————————————————————————————
function clearPageContent(txt) {
	txt = txt.replaceAll('<p>', '')
	txt = txt.replaceAll('</p>', '')
	txt = txt.replaceAll('\n', '')
	txt = txt.replaceAll('<strong>', '')
	txt = txt.replaceAll('</strong>', '')
	return txt.trim()
}

// ————————————————————————————————————————————————————————————————————————————————
// Читання сторінок
// ————————————————————————————————————————————————————————————————————————————————
// Результати
var results = []
// Сторінки на кожну літеру
var as = document.querySelectorAll('.wiki-content-table a:not(.newpage)')
for (var i = 0; i < as.length; i++) {
	console.log(as[i].href)
	var response = await fetch(as[i].href)
	var html = await response.text()
	var doc = new DOMParser().parseFromString(html, 'text/html')
	var content = clearPageContent(doc.querySelector('#page-content').innerHTML)
	var lines = content.split('<br>')
	lines.forEach(line => {
		results.push(line.split(','))
	})
}

// ————————————————————————————————————————————————————————————————————————————————
// Показ результатів, які потрібно вставити у MYSQL-таблицю genitive(nominative, genitive)
// ————————————————————————————————————————————————————————————————————————————————
let txt = ''
results.forEach(line => {
	txt += line[0] + '\t' + line[1] + '\n'
})
console.log(txt)

// ————————————————————————————————————————————————————————————————————————————————
// Потім у MYSQL-таблиці потрібно поправити кілька записів із зайвим HTML:
// - Винести слова з виділеним наголосом у поле nomhtml
// - Прибрати html із поля nominative

// - Також прибрати "висячі" em — де <em> починається в genitive одного запису і 
// 		закривається у nominative наступного запису
// ————————————————————————————————————————————————————————————————————————————————
